rocksdb/experiments/M1/results/20260428-130502/db_bench.log
RocksDB:    version 8.11.3
Date:       Tue Apr 28 13:05:02 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777381502925582 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       5.135 micros/op 194754 ops/sec 5.135 seconds 1000000 operations;  193.2 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       5.621 micros/op 177889 ops/sec 5.621 seconds 1000000 operations;  176.4 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       6.233 micros/op 160428 ops/sec 6.233 seconds 1000000 operations;  159.1 MB/s
DB path: [rocksdbtest/dbbench]
compact      : 12916463.000 micros/op 0 ops/sec 12.917 seconds 1 operations;


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   1.0      0.0    492.8      5.94              4.45        49    0.121       0      0       0.0       0.0
  L1      0/0    0.00 KB   0.0      4.7     2.9      1.8       3.6      1.7       0.0   1.2    272.6    207.7     17.59             14.83         8    2.199   4766K  1135K       0.0       0.0
  L2     15/0   956.07 MB   0.4      3.2     1.3      1.9       2.4      0.5       0.4   1.9    324.4    243.6     10.24              8.74        14    0.731   3301K   822K       0.0       0.0
 Sum     15/0   956.07 MB   0.0      7.9     4.2      3.8       8.9      5.1       0.4   3.1    240.4    268.7     33.77             28.02        71    0.476   8068K  1958K       0.0       0.0
 Int      0/0    0.00 KB   0.0      7.7     3.9      3.8       8.1      4.3       0.4   3.5    244.3    257.6     32.24             26.90        61    0.529   7826K  1937K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      7.9     4.2      3.8       6.0      2.2       0.0   0.0    291.7    220.9     27.83             23.57        22    1.265   8068K  1958K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   0.0      0.0    492.8      5.94              4.45        49    0.121       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 29.9 total, 26.9 interval
Flush(GB): cumulative 2.858, interval 2.324
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 8.86 GB write, 303.32 MB/s write, 7.93 GB read, 271.37 MB/s read, 33.8 seconds
Interval compaction: 8.11 GB write, 308.66 MB/s write, 7.69 GB read, 292.67 MB/s read, 32.2 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x56444231bdf0#41824 capacity: 32.00 MB seed: 1629272846 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 9e-05 secs_since: 29
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 29.9 total, 26.9 interval
Cumulative writes: 3000K writes, 3000K keys, 3000K commit groups, 1.0 writes per commit group, ingest: 2.95 GB, 100.99 MB/s
Cumulative WAL: 3000K writes, 0 syncs, 3000000.00 writes per sync, written: 2.95 GB, 100.99 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 2371K writes, 2371K keys, 2371K commit groups, 1.0 writes per commit group, ingest: 2388.07 MB, 88.75 MB/s
Interval WAL: 2371K writes, 0 syncs, 2371278.00 writes per sync, written: 2.33 GB, 88.75 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0